// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает сумму первой и последней цифры этого числа

int a = 785;
Console.WriteLine((a / 100) + (a % 10));
